### Definição de DataFrame: é um objeto bi-dimensional que contem dados em forma tabular, ou seja, é como se fosse uma tabela do Excel, que é possível adicionar linhas e colunas

In [2]:
import pandas as pd

In [3]:
# Criando DataFrame
df1 = pd.DataFrame ()

In [4]:
df1

Empty DataFrame
Columns: []
Index: []

In [5]:
type(df1)

pandas.core.frame.DataFrame

In [6]:
# importacia de dicionarias
dict1 = {'Identificacao': [1,2,3,4,5],
         'Nome':['Leandro', 'Dulcinea','Theo','Thor','Clarice']}

In [7]:
dict1

{'Identificacao': [1, 2, 3, 4, 5],
 'Nome': ['Leandro', 'Dulcinea', 'Theo', 'Thor', 'Clarice']}

In [8]:
df2 = pd.DataFrame(data= dict1)

In [9]:
df2

   Identificacao      Nome
0              1   Leandro
1              2  Dulcinea
2              3      Theo
3              4      Thor
4              5   Clarice

In [10]:
df3 = pd.DataFrame(data= dict1, index=[29,1,0,2222,88])

In [11]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

In [12]:
serie1 = pd.Series([1,2,3])

In [13]:
serie1

0    1
1    2
2    3
dtype: int64

In [14]:
type(serie1)

pandas.core.series.Series

In [15]:
serie2 = pd.Series(['a','b','c'])

In [16]:
serie2

0    a
1    b
2    c
dtype: object

In [17]:
df4 = pd.DataFrame({'coluna1':serie1,
                   'coluna2': serie2})

In [18]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

#### Meu treino

In [19]:
Nome_Famila = {'Nome': ['Leandro', 'Dulci','Theo'],
               'Eu souza': ['Pai','Mãe','Filho']}

In [20]:
df_famila = pd.DataFrame(data= Nome_Famila, index=['Marido', 'Esposa','Bebe'])

In [21]:
df_famila

           Nome Eu souza
Marido  Leandro      Pai
Esposa    Dulci      Mãe
Bebe       Theo    Filho

Final de treino

In [22]:
import numpy as np

In [23]:
array1 = np.array([[1,2,3],
                   ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
                   ['SP','RJ','SP']])

In [24]:
array1

array([['1', '2', '3'],
       ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
       ['SP', 'RJ', 'SP']], dtype='<U14')

In [25]:
type(array1)

numpy.ndarray

In [26]:
df5 = pd.DataFrame(data= array1.transpose(), 
                   index=['linha1','linha2','linha3'],
                   columns =['Identificação','Cidade','Estado'])

In [27]:
df5

       Identificação          Cidade Estado
linha1             1       Sao Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

In [28]:
matriz1 = np.matrix([[1,2,3],
                   ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
                   ['SP','RJ','SP']])

### Selecionando DataFrame

In [29]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

### selecionando data frame

In [30]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

In [31]:
df3['identificacao_mais_5'] = df3['Identificacao'] + 5

In [32]:
df3

      Identificacao      Nome  identificacao_mais_5
29                1   Leandro                     6
1                 2  Dulcinea                     7
0                 3      Theo                     8
2222              4      Thor                     9
88                5   Clarice                    10

In [33]:
df3['index'] = 0

In [34]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
1                 2  Dulcinea                     7      0
0                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [35]:
df3.index = [29,0,1,2222,88]

In [36]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [37]:
df3['Nome']

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [39]:
df3['index']

29      0
0       0
1       0
2222    0
88      0
Name: index, dtype: int64